removeLineFeeds(AString)
'removeLineFeeds' removes the '\n' character from a string
and replaces it with a '\r' which is considered a paragraph boundary.
combinations of "\n\r" and "\r\n" are replaced with a single '\r' character.